# Создать подобие социальной сети. Описать классы, которые должны
# выполнять соответствующие функции (Предлагаю насследовать класс
# авторизации от класса регистрации). Добавить проверку на валидность
# пароля (содержание символов и цифр), проверка на уникальность логина
# пользователя. Человек заходит, и имеет возможность зарегистрироваться
# (ввод логин, пароль, потдверждение пароля), далее входит в свою учетную
# запись. Добавить возможность выхода из учетной записи, и вход в новый
# аккаунт. Создать класс User, котоырй должен разделять роли обычного
# пользователя и администратора. При входе под обычным пользователем мы
# можем добавить новый пост, с определённым содержимим, так же пост
# должен содержать дату публикации. Под учётной записью администратора
# мы можем увидеть всех пользователей нашей системы, дату их регистрации,
# и их посты.

# TODO: do this exercise